Revit 2026 API

# AssemblyDifferenceConfiguration Class

---

The two assemblies being compared have different spatial configuration

SystemObject Autodesk.Revit.DBAssemblyDifference Autodesk.Revit.DBAssemblyDifferenceConfiguration

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssemblyDifferenceConfiguration : AssemblyDifference
```
```vb
Public Class AssemblyDifferenceConfiguration
	Inherits AssemblyDifference
```
```cpp
public ref class AssemblyDifferenceConfiguration : public AssemblyDifference
```
```fsharp
type AssemblyDifferenceConfiguration =
    class
        inherit AssemblyDifference
    end
```

The AssemblyDifferenceConfiguration type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from AssemblyDifference) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from AssemblyDifference) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Assemblies resulting in this difference might be made up of identical elements, but the elements are not arranged in space relative to each other in the same way.

#### Reference

Autodesk.Revit.DB Namespace